""" Задание 1
Есть список a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89].
Выведите все элементы, которых меньше 5. """

a_list = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
for i in a_list:
    if i<5:
        print(i)

""" Задание 2
В списках приводятся следующие списки:
а = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89];
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13].
Вам нужно вернуть список, состоящий из элементов, общих для этих двух списков. """

a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
for i in a:
    if i in b:
        print(i)

""" Задание 3
Сортируйте словарь по значению в порядке возрастания и убывания.

Импортируем нужный модуль и объявляем словарь:
Оператор импорта
d = {1:2, 3:4, 4:3, 2:1, 0:0} """



import operator
d = {1: 2, 3: 4, 4: 3, 2: 1, 0: 0}

sort_rost = dict(sorted(d.items(), key=operator.itemgetter(1)))
print("По возрастанию:", sort_rost)

sort_ub = dict(sorted(d.items(), key=operator.itemgetter(1), reverse=True))
print("По убыванию:", sort_ub)

""" Задание 4
Напишите программу для объединения нескольких словарей в один.
Допустим, вот наши словари:
dict_a = {1:10, 2:20}
dict_b = {3:30, 4:40}
dict_c = {5:50, 6:60} """ 


dict_a = {1: 10, 2: 20}
dict_b = {3: 30, 4: 40}
dict_c = {5: 50, 6: 60}

ob_sl = {**dict_a, **dict_b, **dict_c}
print(ob_sl)

""" Задание 5
Найдите три ключа с наибольшими значениями в словаре my_dict = {'a':500, 'b':5874, 'c': 560,'d':400, 'e':5874, 'f': 20}. """

my_dict = {'a': 500, 'b': 5874, 'c': 560, 'd': 400, 'e': 5874, 'f': 20}

sort_zn = sorted(my_dict, key=my_dict.get, reverse=True)[:3]

print(sort_zn)
